
var tomValidate = function () {

    //正则
    var RegExpObject  = {
        // 身份证
        idCard : /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,
        //identityCard : /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}\d|[X]{1}$/,
        // 手机号
        mobile: /^((1[3|4|5|7|8][0-9]{1})+\d{8})$/,
        // 电子邮箱
        email: /^\w+((-\w+)|(\.\w+))*\@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$/,
        // 座机
        phone: /^0\d{2,3}-?\d{7,8}$/,
        // 数字
        number: /^[0-9]*$/,
        // 非零正整数
        NZ_number: /^\+?[1-9][0-9]*$/,
        // 非零负整数
        _NZ_number: /^\-[1-9][0-9]*$/,
        // 非负整数（正整数 + 0）
        _noIntNumber: /^\d+$/,
        // 非正整数（负整数 + 0）
        noIntNumber: /^((-\d+)|(0+))$/,
        // 整数
        intNumber: /^-?\d+$/,
        // 正浮点小数
        doubleNumber: /^(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*))$/,
        // 非正浮点小数（负浮点小数 + 0）
        _noDoubleNum: /^((-\d+(\.\d+)?)|(0+(\.0+)?))$/,
        // 负浮点小数
        _doubleNumber: /^(-(([0-9]+\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/,
        // 浮点数
        double: /^(-?\d+)(\.\d+)?$/,
        // 小写字母开头 小写字母和数字组合（4-8）
        loginName:  /^[a-z][a-z0-9]{3,7}$/,
        // 非中文
        chinaName: /[^\u4e00-\u9fa5]/,

    }

    var validate = function (obj,vobj) {
        return  new RegExp(vobj).test(obj);
    }

    return{
        vobj:RegExpObject,
        v:validate,
    }
}();